In [1]:
#dibutuhkan jupyter notebook untuk menggunakan sql magic
# 5 digunakan agar lokasi instalasi berada di venv
%pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.5.0-py3-none-any.whl.metadata (17 kB)
Collecting prettytable (from ipython-sql)
  Downloading prettytable-3.16.0-py3-none-any.whl.metadata (33 kB)
Requirement already satisfied: ipython in .\.venv\lib\site-packages (from ipython-sql) (9.4.0)
Collecting sqlalchemy>=2.0 (from ipython-sql)
  Downloading sqlalchemy-2.0.41-cp313-cp313-win_amd64.whl.metadata (9.8 kB)
Collecting sqlparse (from ipython-sql)
  Downloading sqlparse-0.5.3-py3-none-any.whl.metadata (3.9 kB)
Requirement already satisfied: six in .\.venv\lib\site-packages (from ipython-sql) (1.17.0)
Collecting ipython-genutils (from ipython-sql)
  Downloading ipython_genutils-0.2.0-py2.py3-none-any.whl.metadata (755 bytes)
Collecting greenlet>=1 (from sqlalchemy>=2.0->ipython-sql)
  Downloading greenlet-3.2.3-cp313-cp313-win_amd64.whl.metadata (4.2 kB)
Collecting typing-extensions>=4.6.0 (from sqlalchemy>=2.0->ipython-sql)
  Downloading typing_extensions-4.14.1-py3-none-any.whl.metadata (3.0 kB)
Requirement already satisfied: colorama in .\.venv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: decorator in .\.venv\lib\site-packages (from ipython->ipython-sql) (5.2.1)
Requirement already satisfied: ipython-pygments-lexers in .\.venv\lib\site-packages (from ipython->ipython-sql) (1.1.1)
Requirement already satisfied: jedi>=0.16 in .\.venv\lib\site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline in .\.venv\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in .\.venv\lib\site-packages (from ipython->ipython-sql) (3.0.51)
Requirement already satisfied: pygments>=2.4.0 in .\.venv\lib\site-packages (from ipython->ipython-sql) (2.19.2)
Requirement already satisfied: stack_data in .\.venv\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in .\.venv\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: wcwidth in .\.venv\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in .\.venv\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in .\.venv\lib\site-packages (from stack_data->ipython->ipython-sql) (2.2.0)
Requirement already satisfied: asttokens>=2.1.0 in .\.venv\lib\site-packages (from stack_data->ipython->ipython-sql) (3.0.0)
Requirement already satisfied: pure-eval in .\.venv\lib\site-packages (from stack_data->ipython->ipython-sql) (0.2.3)
Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Downloading sqlalchemy-2.0.41-cp313-cp313-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---------------------------------------- 2.1/2.1 MB 15.9 MB/s eta 0:00:00
Downloading ipython_genutils-0.2.0-py2.py3-none-any.whl (26 kB)
Downloading prettytable-3.16.0-py3-none-any.whl (33 kB)
Downloading sqlparse-0.5.3-py3-none-any.whl (44 kB)
Downloading greenlet-3.2.3-cp313-cp313-win_amd64.whl (297 kB)
Downloading typing_extensions-4.14.1-py3-none-any.whl (43 kB)
Installing collected packages: ipython-genutils, typing-extensions, sqlparse, prettytable, greenlet, sqlalchemy, ipython-sql
Successfully installed greenlet-3.2.3 ipython-genutils-0.2.0 ipython-sql-0.5.0 prettytable-3.16.0 sqlalchemy-2.0.41 sqlparse-0.5.3 typing-extensions-4.14.1
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
#native postgres library to connect to postgres database server
%pip install psycopg2-binary

Collecting psycopg2-binary
  Downloading psycopg2_binary-2.9.10-cp313-cp313-win_amd64.whl.metadata (4.8 kB)
Downloading psycopg2_binary-2.9.10-cp313-cp313-win_amd64.whl (2.6 MB)
   ---------------------------------------- 0.0/2.6 MB ? eta -:--:--
   ---------------------------------------- 2.6/2.6 MB 15.9 MB/s eta 0:00:00
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.9.10
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
# SQL Alchemy is ORM and need native database libraries (psycopg2)
# pandas internally uses sql alchemy to connect to database
%pip install sqlalchemy

Requirement already satisfied: sqlalchemy in .\.venv\lib\site-packages (2.0.41)
Requirement already satisfied: greenlet>=1 in .\.venv\lib\site-packages (from sqlalchemy) (3.2.3)
Requirement already satisfied: typing-extensions>=4.6.0 in .\.venv\lib\site-packages (from sqlalchemy) (4.14.1)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL = postgresql://fifada_dwh_user:password@localhost:5432/fifada_dwh

env: DATABASE_URL=postgresql://fifada_dwh_user:password@localhost:5432/fifada_dwh

In [3]:
%env DATABASE_URL

'postgresql://fifada_dwh_user:password@localhost:5432/fifada_dwh'

Koneksi ke postgres menggunakan sql magic

In [5]:
%%sql

select * from dim_customer limit 10

 * postgresql://fifada_dwh_user:***@localhost:5432/fifada_dwh
10 rows affected.

[(1, 'Richard', 'Hernandez', 'XXXXXXXXX', 'Brownsville', 'TX', '78521'),
 (2, 'Mary', 'Barrett', 'XXXXXXXXX', 'Littleton', 'CO', '80126'),
 (3, 'Ann', 'Smith', 'XXXXXXXXX', 'Caguas', 'PR', '00725'),
 (4, 'Mary', 'Jones', 'XXXXXXXXX', 'San Marcos', 'CA', '92069'),
 (5, 'Robert', 'Hudson', 'XXXXXXXXX', 'Caguas', 'PR', '00725'),
 (6, 'Mary', 'Smith', 'XXXXXXXXX', 'Passaic', 'NJ', '07055'),
 (7, 'Melissa', 'Wilcox', 'XXXXXXXXX', 'Caguas', 'PR', '00725'),
 (8, 'Megan', 'Smith', 'XXXXXXXXX', 'Lawrence', 'MA', '01841'),
 (9, 'Mary', 'Perez', 'XXXXXXXXX', 'Caguas', 'PR', '00725'),
 (10, 'Melissa', 'Smith', 'XXXXXXXXX', 'Stafford', 'VA', '22554')]

Koneksi ke postgres menggunakan pandas

In [6]:
conn_uri = 'postgresql://fifada_dwh_user:password@localhost:5432/fifada_dwh'

In [ ]:
import pandas as pd
# pd.read_sql('dim_customer', conn_uri)
# pd.read_sql('SELECT * FROM dim_customer', conn_uri)
query = '''
    SELECT status, count(*) AS order_count
    FROM dim_order
    GROUP BY 1
    ORDER BY 2 DESC
'''
pd.read_sql(query, conn_uri)

            status  order_count
0         COMPLETE        22899
1  PENDING_PAYMENT        15030
2       PROCESSING         8275
3          PENDING         7610
4           CLOSED         7556
5          ON_HOLD         3798
6  SUSPECTED_FRAUD         1558
7         CANCELED         1428
8   PAYMENT_REVIEW          729

## Latihan python sql

In [ ]:
# konek ke postgres FIFADA
# 1 truncate table fact_order_items
# 2 definisikan kolom-kolom table fact_order_items (hard_coded)
# 3 read csv fact_order_items dengan nama-nama kolom diatas
# 4 definisikan conn_uri
# 5 tulis csv ke sql menggunakan fungsi:
# df.to_sql(
# 'orders',
# conn_uri,
# if_exists='replace',
# index=False
#)

In [46]:
conn_uri = 'postgresql://fifada_dwh_user:password@localhost:5432//fifada_dwh'

In [47]:
%%sql

select * from fact_order_items limit 10

 * postgresql://fifada_dwh_user:***@localhost:5432/fifada_dwh
0 rows affected.

[]

In [48]:
%%sql

truncate table fact_order_items

 * postgresql://fifada_dwh_user:***@localhost:5432/fifada_dwh
Done.

[]

In [50]:
column_names = [
    'order_item_id',
    'order_id',
    'product_id',
    'customer_id',
    'date_id',
    'quantity',
    'subtotal',
    'price_each'
]

In [51]:
df = pd.read_csv("D:\\data-engineering\\csv_fifada\\fact_order_items.csv", names=column_names, header=None)

In [56]:
conn_uri = 'postgresql+psycopg2://fifada_dwh_user:your_password@localhost:5432/fifada_dwh'

In [57]:
df.to_sql(
    'fact_order_items',
    conn_uri,
    if_exists='replace',
    index=False
)

198

In [58]:
%%sql

select * from fact_order_items limit 10

 * postgresql://fifada_dwh_user:***@localhost:5432/fifada_dwh
10 rows affected.

[(1, 1, 957, 11599, '2013-07-25 00:00:00', 1, 299.98, 299.98),
 (2, 2, 1073, 256, '2013-07-25 00:00:00', 1, 199.99, 199.99),
 (3, 2, 502, 256, '2013-07-25 00:00:00', 5, 250.0, 50.0),
 (4, 2, 403, 256, '2013-07-25 00:00:00', 1, 129.99, 129.99),
 (5, 4, 897, 8827, '2013-07-25 00:00:00', 2, 49.98, 24.99),
 (6, 4, 365, 8827, '2013-07-25 00:00:00', 5, 299.95, 59.99),
 (7, 4, 502, 8827, '2013-07-25 00:00:00', 3, 150.0, 50.0),
 (8, 4, 1014, 8827, '2013-07-25 00:00:00', 4, 199.92, 49.98),
 (9, 5, 957, 11318, '2013-07-25 00:00:00', 1, 299.98, 299.98),
 (10, 5, 365, 11318, '2013-07-25 00:00:00', 5, 299.95, 59.99)]